GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    while ((data[0] >= '0') && (data[0] <= '9'))
    {
	integer = integer * 10 + (data[0] - '0');
	data++;
    }
    
    
    fraction = 0;
    
    if (data[0] == '.')
    {
	digits = 0;
	data++;
        
	while ((data[0] >= '0') && (data[0] <= '9'))
	{
	    if (digits < scale)
	    {
		fraction = fraction * 10 + (data[0] - '0');
		digits++;
	    }
	    data++;
	}
        
	if (data[0] == '\0')
	{
	    if (digits < scale)
	    {
		fraction = fraction * nmea_scale[scale - digits];
	    }
	}
    }
    
    if (data[0] == '\0')
    {
	*p_fixed = integer * nmea_scale[scale] + fraction;
        
	return 1;
    }
    
    return 0;
}

static int nmea_parse_latitude(const uint8_t *data, uint32_t *p_latitude)
{
    uint32_t degrees, minutes;
    
    if ((data[0] >= '0') && (data[0] <= '9') && (data[1] >= '0') && (data[1] <= '9'))
    {
	degrees = (data[0] - '0') * 10 + (data[1] - '0');
	data += 2;
        
	if ((degrees < 90) && (data[0] != '\0') && nmea_parse_fixed(data, &minutes, 7))
	{
	    if (minutes < 600000000)
	    {
		*p_latitude = (uint32_t)(degrees * 10000000u) + (uint32_t)((minutes + 30) / 60);
		
		return 1;
	    }
	}
    }

    return 0;
}

static int nmea_parse_longitude(const uint8_t *data, uint32_t *p_longitude)
{
    uint32_t degrees, minutes;

    if ((data[0] >= '0') && (data[0] <= '9') && (data[1] >= '0') && (data[1] <= '9') && (data[2] >= '0') && (data[2] <= '9'))
    {
	degrees = (data[0] - '0') * 100 + (data[1] - '0') * 10 + (data[2] - '0');
	data += 3;
        
	if ((degrees < 180) && (data[0] != '\0') && nmea_parse_fixed(data, &minutes, 7))
	{
	    if (minutes < 600000000)
	    {
		*p_longitude = (uint32_t)(degrees * 10000000u) + (uint32_t)((minutes + 30) / 60);
		
		return 1;
	    }
	}
    }
    
    return 0;
}

static void nmea_start_sentence(gnss_device_t *device)
{
    nmea_context_t *context = &device->nmea;

    switch (context->sequence) {

    case NMEA_FIELD_SEQUENCE_GGA_END:
	break;

    case NMEA_FIELD_SEQUENCE_GSA_END:
	context->sv_used_count = 0;
	context->sv_used_mask[0] = 0;
	context->sv_used_mask[1] = 0;
	context->sv_used_mask[2] = 0;
	break;

    case NMEA_FIELD_SEQUENCE_GST_END:
	break;

    case NMEA_FIELD_SEQUENCE_GSV_END:
	context->sv_in_view_sentences = 0;
	break;

    case NMEA_FIELD_SEQUENCE_RMC_END:
	break;

    default:
	break;
    }

    context->sequence = NMEA_FIELD_SEQUENCE_START;
}

static void nmea_parse_sentence(gnss_device_t *device, const uint8_t *data, unsigned int length)
{
    nmea_context_t *context = &device->nmea;
    uint32_t sequence, sequence_next;
    uint32_t latitude, longitude, altitude, separation, speed, course;
    uint32_t quality, stddev, pdop, hdop, vdop, date;
    utc_time_t time;
    uint32_t count, sentences, current, svid, elevation, azimuth, snr;

    sequence = context->sequence;
    sequence_next = sequence +1;

    switch (sequence) {

    case NMEA_FIELD_SEQUENCE_START:
	sequence_next = NMEA_FIELD_SEQUENCE_SKIP;

	if ((data[0] == 'G') && ((data[1] == 'P') || (data[1] == 'L') || (data[1] == 'N')))
	{
	    context ->prefix = data[1];

	    /* --GSA is the switch detector in NMEA 0183. If it's GPGSA or GLGSA, then the system
	     * is set up as single GPS/GLONASS system, and we'd see only either a GPGSV or GLGSV
	     * later on. If it's a GNGSA, then another GNGSA will follow, one for GPS and one for 
	     * GLONASS. The constellation will be reported as GPGSV and GLGSV.
	     */
	    if (!strcmp((const char*)(data+2), "GSA"))
	    {
		if (device->seen & NMEA_SENTENCE_MASK_GPGGA)
		{
		    sequence_next = NMEA_FIELD_SEQUENCE_GSA_OPERATION;
			
		    context->mask = (NMEA_FIELD_MASK_PDOP | NMEA_FIELD_MASK_VDOP);
		}
	    }

	    /* -- GSV is used to report the satellite constellation with either GPGSV or GLGSV.
	     * GNGSV is not legal.
	     */
	    else if (!strcmp((const char*)(data+2), "GSV"))
	    {
		if (device->seen & (NMEA_SENTENCE_MASK_GPGGA | NMEA_SENTENCE_MASK_SOLUTION))
		{
		    sequence_next = NMEA_FIELD_SEQUENCE_GSV_SENTENCES;
		}
	    }

	    /* According to the standard, if a receiver is supporting GPS only, the prefix would 
	     * be "GP". If it's a GLONASS only system, or a combined GPS+GLONASS system, then
	     * the prefix should be "GN". However some GLONASS only systems use a "GL" prefix,
	     * and quite a few GNSS_GLONASS systems mix "GP" and "GN" randomly. The system detection
	     * is done via --GSA anyway.
	     */
	    else if (!strcmp((const char*)(data+2), "GGA"))
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_GGA_TIME;
		    
		/* GSA/GSV are subsequent to a GGA */
		device->seen &= ~(NMEA_SENTENCE_MASK_GPGGA |
				  NMEA_SENTENCE_MASK_GPGSA |
				  NMEA_SENTENCE_MASK_GPGSV |
				  NMEA_SENTENCE_MASK_GLGSA |
				  NMEA_SENTENCE_MASK_GLGSV |
				  NMEA_SENTENCE_MASK_SOLUTION); 
		    
		context->mask = (NMEA_FIELD_MASK_POSITION |
				 NMEA_FIELD_MASK_ALTITUDE |
				 NMEA_FIELD_MASK_HDOP);
		    
		context->sv_in_view_sentences = 0;
			
		context->sv_used_count = 0;
		context->sv_used_mask[0] = 0;
		context->sv_used_mask[1] = 0;
		context->sv_used_mask[2] = 0;
			
		device->satellites.count = 0;
	    }

	    else if (!strcmp((const char*)(data+2), "GST"))
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_GST_TIME;
			
		device->seen &= ~(NMEA_SENTENCE_MASK_GPGST | NMEA_SENTENCE_MASK_SOLUTION);
			
		context->mask = (NMEA_FIELD_MASK_EHPE |
				 NMEA_FIELD_MASK_EVPE);
	    }

	    else if (!strcmp((const char*)(data+2), "RMC"))
	    {
		sequence_next = NMEA_FIELD_SEQUENCE_RMC_TIME;
			
		device->seen &= ~(NMEA_SENTENCE_MASK_GPRMC | NMEA_SENTENCE_MASK_SOLUTION);
			
		context->mask = (NMEA_FIELD_MASK_TIME |
				 NMEA_FIELD_MASK_SPEED |
				 NMEA_FIELD_MASK_COURSE);
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_SKIP:
	sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
	break;

    case NMEA_FIELD_SEQUENCE_GGA_TIME:
    case NMEA_FIELD_SEQUENCE_GST_TIME:
    case NMEA_FIELD_SEQUENCE_RMC_TIME:
	if (data[0] == '\0')
	{
	    context->mask &= ~NMEA_FIELD_MASK_TIME;
	}
	else if (nmea_parse_time(data, &time))
	{
	    /* If there is a valid time stamp, and another sentence with a time stamp already been seen,
	     * make sure they have the same time. If not nuke the accumulated sentences.
	     */

	    if (device->seen & (NMEA_SENTENCE_MASK_GPGGA | NMEA_SENTENCE_MASK_GPGST | NMEA_SENTENCE_MASK_GPRMC))
	    {
		if (!nmea_same_time(&device->location.time, &time))
		{
		    device->seen = 0;
		    device->location.type = 0;
		    device->location.mask = 0;
		}
	    }

