GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
	if (context->mask & NMEA_FIELD_MASK_VDOP)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_VDOP;
	}

	/* If the talkes is "GN", then it's a composite fix, which will consist out
	 * of GNGSA, GNGSA, GPGSV & GLGSV. Otherwise only a GPGSA & GPGSV is to be
	 * expected.
	 */

	if (context->prefix == 'N')
	{
	    device->expected |= (NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV);
	    
	    if (!(device->seen & NMEA_SENTENCE_MASK_GPGSA))
	    {
		device->seen |= NMEA_SENTENCE_MASK_GPGSA;
	    }
	    else
	    {
		device->seen |= NMEA_SENTENCE_MASK_GLGSA;
		device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	    }
	}
	else if (context->prefix == 'L')
	{
	    device->expected = (device->expected & ~(NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV)) | (NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV);

	    device->seen |= NMEA_SENTENCE_MASK_GLGSA;
	    device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	}
	else
	{
	    device->expected = (device->expected & ~(NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV)) | (NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV);

	    device->seen |= NMEA_SENTENCE_MASK_GPGSA;
	    device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	}
	break;

    case NMEA_FIELD_SEQUENCE_GST_END:
	device->expected |= NMEA_SENTENCE_MASK_GPGST;

	if (context->mask & NMEA_FIELD_MASK_EHPE)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_EHPE;
	}

	if (context->mask & NMEA_FIELD_MASK_EVPE)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_EVPE;
	}

	device->seen |= NMEA_SENTENCE_MASK_GPGST;
	device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	break;

    case NMEA_FIELD_SEQUENCE_GSV_END:
	if (context->sv_in_view_count == context->sv_in_view_index)
	{
	    context->sv_in_view_sentences = 0;

	    if (context->prefix == 'P')
	    {
		device->seen |= NMEA_SENTENCE_MASK_GPGSV;
	    }

	    if (context->prefix == 'L')
	    {
		device->seen |= NMEA_SENTENCE_MASK_GLGSV;
	    }
	}
	break;

    case NMEA_FIELD_SEQUENCE_RMC_END:
	if (context->mask & NMEA_FIELD_MASK_TIME)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_TIME;
	}

	if (context->mask & NMEA_FIELD_MASK_SPEED)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_SPEED;
	}

	if (context->mask & NMEA_FIELD_MASK_COURSE)
	{
	    device->location.mask |= GNSS_LOCATION_MASK_COURSE;
	}

	device->seen |= NMEA_SENTENCE_MASK_GPRMC;
	device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
	break;

    default:
	break;
    }

    context->sequence = NMEA_FIELD_SEQUENCE_START;

    if (device->init == GNSS_INIT_DONE)
    {
	expected = device->expected & (NMEA_SENTENCE_MASK_GPGGA |
				       NMEA_SENTENCE_MASK_GPGSA |
				       NMEA_SENTENCE_MASK_GPGST |
				       NMEA_SENTENCE_MASK_GPRMC |
				       NMEA_SENTENCE_MASK_GLGSA);
	
	if ((device->seen & expected) == expected)
	{
	    if ((context->status == NMEA_STATUS_DATA_VALID) && (context->navigation != NMEA_NAVIGATION_NONE))
	    {
		device->location.type = (context->navigation == NMEA_NAVIGATION_2D) ? GNSS_LOCATION_TYPE_2D : GNSS_LOCATION_TYPE_3D;
		device->location.numsv = context->sv_used_count;
	    }
	    else
	    {
		device->location.type = GNSS_LOCATION_TYPE_NONE;
		device->location.numsv = 0;

		context->sv_used_count   = 0;
		context->sv_used_mask[0] = 0;
		context->sv_used_mask[1] = 0;
		context->sv_used_mask[2] = 0;
	    }

	    gnss_location(device);
	    
	    device->seen &= ~(NMEA_SENTENCE_MASK_GPGGA |
			      NMEA_SENTENCE_MASK_GPGSA |
			      NMEA_SENTENCE_MASK_GPGST |
			      NMEA_SENTENCE_MASK_GPRMC |
			      NMEA_SENTENCE_MASK_GLGSA);

	    device->seen |= NMEA_SENTENCE_MASK_SOLUTION;
	}
	
	
	expected = device->expected & (NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSV);
	
	if ((device->seen & NMEA_SENTENCE_MASK_SOLUTION) && ((device->seen & expected) == expected))
	{
	    for (n = 0; n < device->satellites.count; n++)
	    {
		svid = device->satellites.info[n].svid;

		if ((svid >= 1) && (svid <= 96) && (context->sv_used_mask[(svid -1) >> 5] & (1ul << ((svid -1) & 31))))
		{
		    device->satellites.info[n].state |= GNSS_SATELLITES_STATE_NAVIGATING;
		}
	    }

	    gnss_satellites(device);
	    
	    device->seen &= ~(NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSV);
	}
    }
}

/************************************************************************************/

#if 0

static inline int8_t ubx_data_int8(const uint8_t *data, unsigned int offset)
{
    return (int8_t)data[offset];
}

static inline int16_t ubx_data_int16(const uint8_t *data, unsigned int offset)
{
    return (int16_t)(((uint16_t)data[offset+0] << 0) |
		     ((uint16_t)data[offset+1] << 8));
}

static inline int32_t ubx_data_int32(const uint8_t *data, unsigned int offset)
{
    return (int32_t)(((uint32_t)data[offset+0] <<  0) |
		     ((uint32_t)data[offset+1] <<  8) |
		     ((uint32_t)data[offset+2] << 16) |
		     ((uint32_t)data[offset+3] << 24));
}

static inline uint8_t ubx_data_uint8(const uint8_t *data, unsigned int offset)
{
    return (uint8_t)data[offset];
}

static inline uint16_t ubx_data_uint16(const uint8_t *data, unsigned int offset)
{
    return (uint16_t)(((uint16_t)data[offset+0] << 0) |
		      ((uint16_t)data[offset+1] << 8));
}

static inline uint32_t ubx_data_uint32(const uint8_t *data, unsigned int offset)
{
    return (uint32_t)(((uint32_t)data[offset+0] <<  0) |
		      ((uint32_t)data[offset+1] <<  8) |
		      ((uint32_t)data[offset+2] << 16) |
		      ((uint32_t)data[offset+3] << 24));
}

#endif


static inline int8_t ubx_data_int8(const uint8_t *data, unsigned int offset)
{
    return *((const int8_t*)((const void*)(&data[offset])));
}

static inline int16_t ubx_data_int16(const uint8_t *data, unsigned int offset)
{
    return *((const int16_t*)((const void*)(&data[offset])));
}

static inline int32_t ubx_data_int32(const uint8_t *data, unsigned int offset)
{
    return *((const int32_t*)((const void*)(&data[offset])));
}

static inline uint8_t ubx_data_uint8(const uint8_t *data, unsigned int offset)
{
    return *((const uint8_t*)((const void*)(&data[offset])));
}

