GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static inline uint16_t ubx_data_uint16(const uint8_t *data, unsigned int offset)
{
    return *((const uint16_t*)((const void*)(&data[offset])));
}

static inline uint32_t ubx_data_uint32(const uint8_t *data, unsigned int offset)
{
    return *((const uint32_t*)((const void*)(&data[offset])));
}

static void ubx_start_message(gnss_device_t *device, unsigned int message, unsigned int length)
{
    if (message == 0x0130)
    {
	/* UBX-NAV-SVINFO */
	    
	device->rx_chunk = 20;
	device->satellites.count = 0;
	
	device->seen &= ~UBX_MESSAGE_MASK_NAV_SVINFO;
    }

    if (message == 0x0135)
    {
	/* UBX-NAV-SAT */
	    
	device->rx_chunk = 20;
	device->satellites.count = 0;
	
	device->seen &= ~UBX_MESSAGE_MASK_NAV_SAT;
    }
}

static void ubx_parse_message(gnss_device_t *device, unsigned int message, uint8_t *data, unsigned int count)
{
    unsigned int gnss, svid;

    if (message == 0x0130)
    {
	/* UBX-NAV-SVINFO */

	svid = ubx_data_uint8(data, 9);

	if (svid && (device->satellites.count < GNSS_SATELLITES_COUNT_MAX))
	{
	    device->satellites.info[device->satellites.count].svid = svid;

	    if (ubx_data_int8(data, 13) > 0)
	    {
		device->satellites.info[device->satellites.count].elevation = ubx_data_int8(data, 13);
		device->satellites.info[device->satellites.count].azimuth = ubx_data_int16(data, 14);
	    }
	    else
	    {
		device->satellites.info[device->satellites.count].elevation = 0;
		device->satellites.info[device->satellites.count].azimuth = 0;
	    }

	    device->satellites.info[device->satellites.count].snr = ubx_data_uint8(data, 12);

	    if (ubx_data_uint8(data, 10) & 0x10)
	    {
 	        device->satellites.info[device->satellites.count].state = GNSS_SATELLITES_STATE_UNHEALTHY;
	    }
	    else
	    {
		device->satellites.info[device->satellites.count].state = 0;

		if (ubx_data_uint8(data, 10) & 0x02)
		{
		    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_CORRECTION;
		}

		switch (ubx_data_uint8(data, 11) & 0x0f) {
		case 0x00: /* NO SIGNAL */
		case 0x01: /* SEARCHING */ 
		    break;
		case 0x02: /* SIGNAL ACQUIRED */
		case 0x03: /* SIGNAL ACQUIRED, BUT UNUSABLE */
		    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_ACQUIRED;
		    break;
		    
		case 0x04: /* SIGNAL ACQUIRED, CODE LOCKED */
		case 0x05: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
		case 0x06: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
		case 0x07: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
		    device->satellites.info[device->satellites.count].state |= (GNSS_SATELLITES_STATE_ACQUIRED | GNSS_SATELLITES_STATE_LOCKED);

		    if (ubx_data_uint8(data, 10) & 0x01)
		    {
			device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_NAVIGATING;
		    }
		    break;
		    
		default:
		    break;
		}
	    }

	    device->satellites.count++;
	}
	
	device->rx_offset += 12;
	device->rx_chunk += 12;
    }

    if (message == 0x0135)
    {
	/* UBX-NAV-SVAT */

	gnss = ubx_data_uint8(data, 8);
	svid = ubx_data_uint8(data, 9);

	if (gnss == 0)
	{
	    /* GPS */
	}
	else if (gnss == 1)
	{
	    /* SBAS */
	}
	else if (gnss == 2)
	{
	    /* GALILEO */
	    svid += 210;
	}
	else if (gnss == 4)
	{
	    /* IMES */
	    svid += 172;
	}
	else if (gnss == 5)
	{
	    /* QZSS */
	    svid += 192;
	}
	else if (gnss == 6)
	{
	    if (svid != 255)
	    {
		svid += 64;
	    }
	}
	else
	{
	    svid = 0;
	}

	if (svid && (device->satellites.count < GNSS_SATELLITES_COUNT_MAX))
	{
	    device->satellites.info[device->satellites.count].svid = svid;

	    device->satellites.info[device->satellites.count].snr = ubx_data_uint8(data, 10);

	    if (ubx_data_int8(data, 11) > 0)
	    {
		device->satellites.info[device->satellites.count].elevation = ubx_data_int8(data, 11);
 		device->satellites.info[device->satellites.count].azimuth = ubx_data_int16(data, 12);
	    }
	    else
	    {
		device->satellites.info[device->satellites.count].elevation = 0;
		device->satellites.info[device->satellites.count].azimuth = 0;
	    }

	    if (ubx_data_uint8(data, 16) & 0x20)
	    {
 	        device->satellites.info[device->satellites.count].state = GNSS_SATELLITES_STATE_UNHEALTHY;
	    }
	    else
	    {
		device->satellites.info[device->satellites.count].state = 0;

		if (ubx_data_uint8(data, 17) & 0x10)
		{
		    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_ALMANAC;
		}
		
		if (ubx_data_uint8(data, 17) & 0x08)
		{
		    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_EPHEMERIS;
		}

		if (ubx_data_uint8(data, 16) & 0x40)
		{
		    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_CORRECTION;
		}
		
		if (ubx_data_uint8(data, 17) & 0x40)
		{
		    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_AUTONOMOUS;
		}

		switch (ubx_data_uint8(data, 16) & 0x07) {
		case 0x00: /* NO SIGNAL */
		case 0x01: /* SEARCHING */ 
		    break;
		case 0x02: /* SIGNAL ACQUIRED */
		case 0x03: /* SIGNAL ACQUIRED, BUT UNUSABLE */
		    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_ACQUIRED;
		    break;
		    
		case 0x04: /* SIGNAL ACQUIRED, CODE LOCKED */
		case 0x05: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
		case 0x06: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
		case 0x07: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
		    device->satellites.info[device->satellites.count].state |= (GNSS_SATELLITES_STATE_ACQUIRED | GNSS_SATELLITES_STATE_LOCKED);

		    if (ubx_data_uint8(data, 16) & 0x08)
		    {
			device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_NAVIGATING;
		    }
		    break;
		    
		default:
		    break;
		}
	    }

	    device->satellites.count++;
	}
	
	device->rx_offset += 12;
	device->rx_chunk += 12;
    }
}

static void ubx_end_message(gnss_device_t *device, unsigned int message, uint8_t *data, unsigned int count)
{
    ubx_context_t *context = &device->ubx;
    unsigned int expected;
    uint16_t week, command;
    int32_t tow;

