GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    if ((message >> 8) == 0x01)
    {
	if (device->seen & (UBX_MESSAGE_MASK_NAV_DOP |
			    UBX_MESSAGE_MASK_NAV_PVT |
			    UBX_MESSAGE_MASK_NAV_SVINFO |
			    UBX_MESSAGE_MASK_NAV_TIMEGPS |
			    UBX_MESSAGE_MASK_SOLUTION))
	{
	    if (context->itow != ubx_data_uint32(data, 0))
	    {
		device->seen = 0;
		device->location.type = 0;
		device->location.mask = 0;
	    }
	}
	
	context->itow = ubx_data_uint32(data, 0);

	switch (message & 0xff) {

	case 0x04:
	    /* UBX-NAV-DOP */

	    device->location.pdop = ubx_data_uint16(data, 6);
	    device->location.hdop = ubx_data_uint16(data, 12);
	    device->location.vdop = ubx_data_uint16(data, 10);

	    device->location.mask |= (GNSS_LOCATION_MASK_PDOP |
				      GNSS_LOCATION_MASK_HDOP |
				      GNSS_LOCATION_MASK_VDOP);

	    device->seen |= UBX_MESSAGE_MASK_NAV_DOP;
	    break;

	case 0x07:
	    /* UBX-NAV-PVT */

	    if ((ubx_data_uint8(data, 11) & 0x03) == 0x03)
	    {
		device->location.time.year = ubx_data_uint16(data, 4) - 1980;
		device->location.time.month = ubx_data_uint8(data, 6);
		device->location.time.day = ubx_data_uint8(data, 7);
		device->location.time.hour = ubx_data_uint8(data, 8);
		device->location.time.minute = ubx_data_uint8(data, 9);
		device->location.time.second = ubx_data_uint8(data, 10);

		if (ubx_data_int32(data, 16) > 0)
		{
		    device->location.time.millis = ((ubx_data_int32(data, 16) + 500000) / 1000000);
		}
		else
		{
		    device->location.time.millis = 0;
		}
	    }
	    else
	    {
		device->location.time.year = 1980 - 1980;
		device->location.time.month = 1;
		device->location.time.day = 6;
		device->location.time.hour = 0;
		device->location.time.minute = 0;
		device->location.time.second = 0;
		device->location.time.millis = 0;
	    }

	    device->location.latitude = ubx_data_int32(data, 28);
	    device->location.longitude = ubx_data_int32(data, 24);
	    device->location.altitude = ubx_data_int32(data, 36);
	    device->location.separation = ubx_data_int32(data, 32) - ubx_data_int32(data, 36);
	    device->location.speed = ubx_data_int32(data, 60);
	    device->location.course = ubx_data_int32(data, 64);
	    device->location.climb = - ubx_data_int32(data, 56);
	    device->location.ehpe = ubx_data_uint32(data, 40);
	    device->location.evpe = ubx_data_uint32(data, 44);

	    switch (ubx_data_uint8(data, 20)) {
	    case 0x00:
		device->location.type = GNSS_LOCATION_TYPE_NONE;
		device->location.quality = GNSS_LOCATION_QUALITY_NONE;
		break;

	    case 0x01:
		device->location.type = GNSS_LOCATION_TYPE_NONE;
		device->location.quality = GNSS_LOCATION_QUALITY_ESTIMATED;
		break;

	    case 0x02:
		device->location.type = GNSS_LOCATION_TYPE_2D;

		if (ubx_data_uint8(data, 21) & 0xc0)
		{
		    device->location.quality = ((ubx_data_uint8(data, 21) & 0x80) ? GNSS_LOCATION_QUALITY_RTK_FIXED : GNSS_LOCATION_QUALITY_RTK_FLOAT);
		}
		else if (ubx_data_uint8(data, 21) & 0x01)
		{
		    device->location.quality = ((ubx_data_uint8(data, 21) & 0x02) ? GNSS_LOCATION_QUALITY_DIFFERENTIAL : GNSS_LOCATION_QUALITY_AUTONOMOUS);
		}
		else
		{
		    device->location.quality = GNSS_LOCATION_QUALITY_NONE;
		}
		break;

	    case 0x03:
		device->location.type = GNSS_LOCATION_TYPE_3D;

		if (ubx_data_uint8(data, 21) & 0xc0)
		{
		    device->location.quality = ((ubx_data_uint8(data, 21) & 0x80) ? GNSS_LOCATION_QUALITY_RTK_FIXED : GNSS_LOCATION_QUALITY_RTK_FLOAT);
		}
		else if (ubx_data_uint8(data, 21) & 0x01)
		{
		    device->location.quality = ((ubx_data_uint8(data, 21) & 0x02) ? GNSS_LOCATION_QUALITY_DIFFERENTIAL : GNSS_LOCATION_QUALITY_AUTONOMOUS);
		}
		else
		{
		    device->location.quality = GNSS_LOCATION_QUALITY_NONE;
		}
		break;

	    case 0x04:
		device->location.type = GNSS_LOCATION_TYPE_2D;
		device->location.quality = GNSS_LOCATION_QUALITY_ESTIMATED;
		break;

	    case 0x05:
		device->location.type = GNSS_LOCATION_TYPE_TIME;
		device->location.quality = GNSS_LOCATION_QUALITY_NONE;
		break;
	    }

	    device->location.numsv = ubx_data_uint8(data, 23);

	    device->location.mask |= (GNSS_LOCATION_MASK_POSITION |
				      GNSS_LOCATION_MASK_ALTITUDE |
				      GNSS_LOCATION_MASK_SPEED |
				      GNSS_LOCATION_MASK_COURSE |
				      GNSS_LOCATION_MASK_CLIMB |
				      GNSS_LOCATION_MASK_EHPE |
				      GNSS_LOCATION_MASK_EVPE);

	    device->seen |= UBX_MESSAGE_MASK_NAV_PVT;
	    device->seen &= ~UBX_MESSAGE_MASK_SOLUTION;
	    break;

	case 0x20:
	    /* UBX-NAV-TIMEGPS */

	    if ((ubx_data_uint8(data, 11) & 0x03) == 0x03)
	    {
		tow  = ubx_data_uint32(data, 0) + (ubx_data_int32(data, 4) + 500000) / 1000000;
		week = ubx_data_uint16(data, 8);

		if (tow < 0)
		{
		    tow += 604800000;
		    week -= 1;
		}
		
		if (tow >= 604800000)
		{
		    tow -= 604800000;
		    week += 1;
		}

		context->week = week;
		context->tow = tow;
		
		device->location.correction = ubx_data_uint8(data, 10);
	    }
	    else
	    {
		context->week = 0;
		context->tow = 0;

		device->location.correction = 0;
	    }

	    device->seen |= UBX_MESSAGE_MASK_NAV_TIMEGPS;
	    device->seen &= ~UBX_MESSAGE_MASK_SOLUTION;
	    break;

	case 0x30:
	    /* UBX-NAV-SVINFO */

	    device->seen |= UBX_MESSAGE_MASK_NAV_SVINFO;
	    break;

	case 0x35:
	    /* UBX-NAV-SAT */

	    device->seen |= UBX_MESSAGE_MASK_NAV_SAT;
	    break;

	default:
	    break;
	}
    }

    else if (message == 0x0500)
    {
	/* UBX-ACK-NACK */
	command = ((ubx_data_uint8(data, 0) << 8) | ubx_data_uint8(data, 1));

	// printf("NACK %04x\r\n", command);

	if (command == device->command)
	{
	    device->command = ~0l;
	    
	    ubx_configure(device, GNSS_RESPONSE_NACK, command);
	}
    }

    else if (message == 0x0501)
    {
	/* UBX-ACK-ACK */
	command = ((ubx_data_uint8(data, 0) << 8) | ubx_data_uint8(data, 1));

	// printf("ACK %04x\r\n", command);

	if (command == device->command)
	{
	    device->command = ~0l;
	    
	    ubx_configure(device, GNSS_RESPONSE_ACK, command);
	}
    }

    else if (message == 0x0a28)
    {
	// printf("RESPONSE %04x\r\n", message);

	/* UBX-NON-GNSS */
	device->ubx.gnss.supported = ubx_data_uint8(data, 1);
	device->ubx.gnss.defaultGnss = ubx_data_uint8(data, 2);
	device->ubx.gnss.enabled = ubx_data_uint8(data, 3);
	device->ubx.gnss.simultaneous = ubx_data_uint8(data, 4);

	if (message == device->command)
	{
	    device->command = ~0l;
	    
	    ubx_configure(device, GNSS_RESPONSE_ACK, message);
	}
    }

    if (device->init == GNSS_INIT_DONE)
    {
	expected = device->expected & (UBX_MESSAGE_MASK_NAV_DOP |
				       UBX_MESSAGE_MASK_NAV_PVT |
				       UBX_MESSAGE_MASK_NAV_TIMEGPS);
	
	if ((device->seen & expected) == expected)
	{
	    if (context->week && device->location.time.year)
	    {
		if (!(device->seen & UBX_MESSAGE_MASK_NAV_TIMEGPS))
		{
		    device->location.correction = utc_offset_time(&device->location.time, context->week, context->tow);
		}

		device->location.mask |= (GNSS_LOCATION_MASK_TIME | GNSS_LOCATION_MASK_CORRECTION);
	    }
	    
