GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t ubx_cfg_gnss_qzss_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x05, 0x00, 0x03, 0x00, 0x00, 0x00, 0x01, 0x01, /* QZSS                      */
    0x5a, 0xe6,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_sbas_none[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x16,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* MODE                      */
    0x03,                                           /* USAGE                     */
    0x03,                                           /* MAX SBAS                  */
    0x00,                                           /* SCANMODE2                 */
    0x00, 0x00, 0x00, 0x00,                         /* SCANMODE1 (133, 135, 138) */
    0x2a, 0xb1,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_sbas_auto[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x16,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* MODE                      */
    0x03,                                           /* USAGE                     */
    0x03,                                           /* MAX SBAS                  */
    0x00,                                           /* SCANMODE2                 */
    0x00, 0x00, 0x00, 0x00,                         /* SCANMODE1                 */
    0x2b, 0xb9,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_rxm_continuous[] = {
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x11,                                     /* CLASS, ID                 */
    0x02, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* RESERVED                  */
    0x00,                                           /* MODE                      */
    0x19, 0x81,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_rxm_powersave[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x11,                                     /* CLASS, ID                 */
    0x02, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* RESERVED                  */
    0x01,                                           /* MODE                      */
    0x1a, 0x82,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_save[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x09,                                     /* CLASS, ID                 */
    0x0d, 0x00,                                     /* LENGTH                    */
    0x00, 0x00, 0x00, 0x00,                         /* CLEAR MASK                */
    0xff, 0xff, 0xff, 0xff,                         /* SAVE MASK                 */
    0x00, 0x00, 0x00, 0x00,                         /* LOAD MASK                 */
    0x01,                                           /* DEVICE MASK               */
    0x19, 0x9c,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_rxm_pmreq[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x02, 0x41,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x00, 0x00, 0x00, 0x00,                         /* DURATION                  */
    0x02, 0x00, 0x00, 0x00,                         /* FLAGS                     */
    0x4d, 0x3b,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_mon_gnss[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x0a, 0x28,                                     /* CLASS, ID                 */
    0x00, 0x00,                                     /* LENGTH                    */
    0x32, 0xa0,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_ant_internal[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x13,                                     /* CLASS, ID                 */
    0x04, 0x00,                                     /* LENGTH                    */
    0x01, 0x00,                                     /* FLAGS                     */
    0xf0, 0xb9,                                     /* PINS                      */
    0xc7, 0x6a,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_ant_external[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x13,                                     /* CLASS, ID                 */
    0x04, 0x00,                                     /* LENGTH                    */
    0x00, 0x00,                                     /* FLAGS                     */
    0xf0, 0xb9,                                     /* PINS                      */
    0xc6, 0x66,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_aop_enable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x23,                                     /* CLASS, ID                 */
    0x28, 0x00,                                     /* LENGTH                    */
    0x00, 0x00,                                      /* VERSION                   */
    0x00, 0x40,                                     /* MASK1                     */
    0x00, 0x00, 0x00, 0x00,                         /* MASK2                     */
    0x00, 0x00,                                     /* RESERVED1                 */
    0x00,                                           /* MIN SVS                   */
    0x00,                                           /* MAX SVS                   */
    0x00,                                           /* MIN CNO                   */
    0x00,                                           /* RESERVED2                 */
    0x00,                                           /* INI FIX 3D                */
    0x00, 0x00,                                     /* RESERVED3                 */
    0x00,                                           /* ACK AIDING                */
    0x00, 0x00,                                     /* WKN ROLLOVER              */
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00,             /* RESERVED4                 */
    0x00,                                           /* USE PPP                   */
    0x01,                                           /* AOP CFG                   */
    0x00, 0x00,                                     /* RESERVED5                 */
    0x00, 0x00,                                     /* AOP ORB MAX ERR           */
    0x00, 0x00, 0x00, 0x00,                         /* RESERVED6                 */
    0x00, 0x00, 0x00,                               /* RESERVED7                 */
    0x00,                                           /* USE ADR                   */
    0x92, 0xc6,                                     /* CK_A, CK_B                */
};

