GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_CHECKSUM_2:
		if (c == nmea_hex_ascii[device->checksum & 0x0f])
		{
		    device->state = GNSS_STATE_NMEA_END_CR;
		}
		else
		{
		    /* If there is a checksum error, then scan again for a new start.
		     */

		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_END_CR:
		if (c == '\r')
		{
		    device->state = GNSS_STATE_NMEA_END_LF;
		}
		else
		{
		    /* If there is an illegal char, then scan again for a new start.
		     */

		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_END_LF:
		if (c == '\n')
		{
		    if (device->init != GNSS_INIT_DONE)
		    {
			if (device->init == GNSS_INIT_UBX_BAUD_RATE)
			{
			    ubx_configure(device, GNSS_RESPONSE_NMEA_SENTENCE, ~0l);
			}
		    }

		    nmea_end_sentence(device);
		}
		 
		device->state = GNSS_STATE_START;
		break;

	    case GNSS_STATE_UBX_SYNC_2:
		if (c != 0x62)
		{
		    device->state = GNSS_STATE_START;
		}		
		else
		{
		    device->state = GNSS_STATE_UBX_MESSAGE_1;
		}
		break;
		
	    case GNSS_STATE_UBX_MESSAGE_1:
		device->ubx.ck_a = c;
		device->ubx.ck_b = c;
		device->ubx.message = (c << 8);
		device->state = GNSS_STATE_UBX_MESSAGE_2;
		break;
		
	    case GNSS_STATE_UBX_MESSAGE_2:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->ubx.message |= c;
		device->state = GNSS_STATE_UBX_LENGTH_1;
		break;

	    case GNSS_STATE_UBX_LENGTH_1:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->ubx.length = c;
		device->state = GNSS_STATE_UBX_LENGTH_2;
		break;
		
	    case GNSS_STATE_UBX_LENGTH_2:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->rx_count = 0;
		device->rx_offset = 0;
		device->rx_chunk = ~0l;
		device->ubx.length |= (c << 8);

		ubx_start_message(device, device->ubx.message, device->ubx.length);

		if (device->rx_count == device->ubx.length)
		{
		    device->state = GNSS_STATE_UBX_CK_A;
		}
		else
		{
		    device->state = GNSS_STATE_UBX_PAYLOAD;
		}
		break;
	    
	    case GNSS_STATE_UBX_PAYLOAD:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;

		if ((device->rx_count - device->rx_offset) < GNSS_RX_DATA_SIZE)
		{
		    device->rx_data[device->rx_count - device->rx_offset] = c;
		}
		
		device->rx_count++;
		
		if (device->rx_count == device->rx_chunk)
		{
		    ubx_parse_message(device, device->ubx.message, &device->rx_data[0], device->rx_count);
		}

		if (device->rx_count == device->ubx.length)
		{
		    device->state = GNSS_STATE_UBX_CK_A;
		}
		break;

	    case GNSS_STATE_UBX_CK_A:
		device->ubx.ck_a ^= c;
		device->state = GNSS_STATE_UBX_CK_B;
		break;
		
	    case GNSS_STATE_UBX_CK_B:
		device->ubx.ck_b ^= c;

		if ((device->ubx.ck_a == 0x00) &&  (device->ubx.ck_b == 0x00))
		{
		    if (device->init != GNSS_INIT_DONE)
		    {
			if (device->init == GNSS_INIT_UBX_BAUD_RATE)
			{
			    ubx_configure(device, GNSS_RESPONSE_UBX_MESSAGE, ~0l);
			}
		    }

		    if ((device->rx_count - device->rx_offset) <= GNSS_RX_DATA_SIZE)
		    {
			ubx_end_message(device, device->ubx.message, &device->rx_data[0], device->rx_count);
		    }
		}

		device->state = GNSS_STATE_START;
		break;

	    default:
		break;
	    }
	}
    }
}

void gnss_initialize(unsigned int protocol, unsigned int rate, unsigned int speed, gnss_send_routine_t send_routine, gnss_location_callback_t location_callback, gnss_satellites_callback_t satellites_callback, void *context)
{
    gnss_device_t *device = &gnss_device;
    const char *uart_data = NULL;
    unsigned int uart_count = 0;

    device->send_routine = send_routine;
    device->location_callback = location_callback;
    device->satellites_callback = satellites_callback;
    device->context = context;

    device->state = GNSS_STATE_START;
    device->command = -1;
    device->busy = 0;

    memset(&device->location, 0, sizeof(device->location));
    memset(&device->satellites, 0, sizeof(device->satellites));

    device->protocol = protocol;
    device->rate = rate;

    if (protocol == GNSS_PROTOCOL_UBLOX)
    {
	device->init = GNSS_INIT_UBX_BAUD_RATE;

	device->table = ubx_init_table;

	if (speed >= 115200)
	{
	    uart_data = "$PUBX,41,1,0007,0003,115200,0*18\r\n";
	}
	else if (speed >= 57600)
	{
	    uart_data = "$PUBX,41,1,0007,0003,57600,0*2B\r\n";
	}
	else if (speed >= 38400)
	{
	    uart_data = "$PUBX,41,1,0007,0003,38400,0*20\r\n";
	}
	else if (speed >= 19200)
	{
	    uart_data = "$PUBX,41,1,0007,0003,19200,0*25\r\n";
	}
	else
	{
	    uart_data = "$PUBX,41,1,0007,0003,9600,0*10\r\n";
	}
	
	uart_count = strlen(uart_data);

	stm32l0_rtc_timer_create(&device->ubx.timeout, (stm32l0_rtc_callback_t)&ubx_timeout, device);
    }
    else
    {
	device->init = GNSS_INIT_DONE;
	device->table = NULL;
	device->expected = NMEA_SENTENCE_MASK_GPGGA | NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GPRMC;
    }

    if (uart_data)
    {
	(device->send_routine)(device->context, (const uint8_t*)uart_data, uart_count, NULL);
    }
}

bool gnss_set_antenna(unsigned int antenna)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->protocol) {
    case GNSS_PROTOCOL_NMEA:
	break;
    case GNSS_PROTOCOL_UBLOX:
	ubx_table(device, ((antenna == GNSS_ANTENNA_EXTERNAL) ? ubx_ant_external_table : ubx_ant_internal_table));
	break;
    }

    return true;
}

unsigned int gnss_get_constellation(void)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->protocol) {
    case GNSS_PROTOCOL_NMEA:
	break;
    case GNSS_PROTOCOL_UBLOX:
	if (!device->ubx.gnss.simultaneous) {
	    return GNSS_CONSTELLATION_GPS;
	} else {
	    return device->ubx.gnss.enabled;
	}
	break;
    }

    return 0;
}

bool gnss_set_constellation(unsigned int mask)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->protocol) {
    case GNSS_PROTOCOL_NMEA:
	break;
    case GNSS_PROTOCOL_UBLOX:
	if (device->ubx.gnss.simultaneous) {
	    mask = (mask & device->ubx.gnss.supported) | GNSS_CONSTELLATION_GPS;

	    if (device->ubx.gnss.enabled != mask) {
		device->ubx.gnss.enabled = mask;

		ubx_table(device, ((mask & GNSS_CONSTELLATION_GLONASS) ? ubx_constellation_gps_glonass_table : ubx_constellation_gps_table));
	    }
	}
	break;
    }

